// Задача 25: Напишите программу, которая принимает на вход два числа (A и B)
// и метод который возводит число A в натуральную степень B.
// Задание должно быть выполнено в методе. В методе не должно быть вывода в консоль.
// Не использовать Math.Pow()



// Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
// 452 -> 11
// 82 -> 10
// 9012 -> 12



// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.

// 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
// 6, 1, 33 -> [6, 1, 33]
